# GetFailureHandlingOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..GetFailureHandlingOptions Method
FailuresAccessor Class See Also
---
Provides access to the failure handling options for the transaction currently being finished.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureHandlingOptions GetFailureHandlingOptions()
```

Visual Basic
---
```text
Public Function GetFailureHandlingOptions As FailureHandlingOptions
```

Visual C++
---
```text
public:
FailureHandlingOptions^ GetFailureHandlingOptions()
```

# ### Return Value
The failure handling options for transaction currently being finished.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace